# ðŸ¢ Employee SQL Tutorial for Beginners

Welcome! This notebook will teach you SQL using an employee database.

## ðŸ“Š Database Overview

We have 4 tables:
- **departments** - Company departments
- **employees** - Employee information
- **projects** - Company projects
- **employee_projects** - Who works on which project

---

## Setup - Run this first!

In [ ]:
import sqlite3
import pandas as pd

# Connect to database
conn = sqlite3.connect('employee.db')

# Helper function to run SQL queries
def run_sql(query):
    return pd.read_sql_query(query, conn)

print("âœ… Connected to employee database!")

## Let's Look at Our Tables First

In [ ]:
# View the departments table
run_sql("SELECT * FROM departments")

In [ ]:
# View the employees table
run_sql("SELECT * FROM employees")

In [ ]:
# View the projects table
run_sql("SELECT * FROM projects")

In [ ]:
# View the employee_projects table
run_sql("SELECT * FROM employee_projects")

---
#SQL Practice Problems

Try to solve each problem yourself first, then check the answer below!

---

## Problem 1: SELECT All Employees
**Question:** Get all columns from the `employees` table.

**Hint:** Use `SELECT * FROM table_name`

In [ ]:
# Write your answer here:
run_sql("""

""")

### âœ… Answer 1

In [ ]:
# Answer:
run_sql("""
SELECT * FROM employees
""")

# Expected: 15 rows with all employee information

---
## Problem 2: SELECT Specific Columns
**Question:** Get only `first_name`, `last_name`, and `salary` from employees.

**Hint:** List column names separated by commas

In [ ]:
# Write your answer here:
run_sql("""

""")

### âœ… Answer 2

In [ ]:
# Answer:
run_sql("""
SELECT first_name, last_name, salary FROM employees
""")

# Expected: 15 rows with only first_name, last_name, salary columns

---
## Problem 3: WHERE Clause - Filter by Department
**Question:** Find all employees in department_id = 1 (Engineering).

**Hint:** Use `WHERE column = value`

In [ ]:
# Write your answer here:
run_sql("""

""")

###  Answer 3

In [ ]:
# Answer:
run_sql("""
SELECT * FROM employees
WHERE department_id = 1
""")

# Expected: 5 rows (John, Sarah, Emily, Robert, William)

---
## Problem 4: Salary Filter
**Question:** Find all employees with salary greater than $70,000.

**Hint:** Use `WHERE salary > 70000`

In [ ]:
#Write your answer here:
run_sql("""

""")

### âœ… Answer 4

In [ ]:
# Answer:
run_sql("""
SELECT * FROM employees
WHERE salary > 70000
""")

# Expected: 8 rows (employees earning more than $70,000)

---
## Problem 5: ORDER BY Salary
**Question:** Get all employees ordered by salary from highest to lowest.

**Hint:** Use `ORDER BY column DESC`

In [ ]:
#Write your answer here:
run_sql("""

""")

### Answer 5

In [ ]:
# Answer:
run_sql("""
SELECT * FROM employees
ORDER BY salary DESC
""")

# Expected: 15 rows, starting with Robert ($110,000) at the top

---
## Problem 6: Top 5 Highest Paid
**Question:** Get the top 5 highest paid employees.

**Hint:** Combine `ORDER BY` and `LIMIT`

In [ ]:
#Write your answer here:
run_sql("""

""")

### Answer 6

In [ ]:
# Answer:
run_sql("""
SELECT * FROM employees
ORDER BY salary DESC
LIMIT 5
""")

# Expected: Robert ($110,000), Emily ($95,000), Jessica ($88,000), Sarah ($85,000), Anna ($80,000)

---
## Problem 7: COUNT Employees per Department
**Question:** How many employees are in each department?

**Hint:** Use `COUNT(*)` with `GROUP BY`

In [ ]:
#Write your answer here:
run_sql("""

""")

### âœ… Answer 7

In [ ]:
# Answer:
run_sql("""
SELECT department_id, COUNT(*) as employee_count
FROM employees
GROUP BY department_id
""")

# Expected: Dept 1: 5, Dept 2: 3, Dept 3: 2, Dept 4: 2, Dept 5: 3

---
## Problem 8: Average Salary
**Question:** What is the average salary of all employees?

**Hint:** Use `AVG(column)`

In [ ]:
#Write your answer here:
run_sql("""

""")

### âœ… Answer 8

In [ ]:
# Answer:
run_sql("""
SELECT AVG(salary) as average_salary
FROM employees
""")

# Expected: ~$74,000

---
## Problem 9: Average Salary per Department
**Question:** What is the average salary for each department?

**Hint:** Use `AVG(salary)` with `GROUP BY department_id`

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 9

In [ ]:
# Answer:
run_sql("""
SELECT department_id, AVG(salary) as avg_salary
FROM employees
GROUP BY department_id
""")

# Expected: Each department with its average salary

---
## Problem 10: JOIN - Employees with Department Names
**Question:** Show employee names with their department names (not just IDs).

ðŸ’¡ **Hint:** Use `JOIN departments ON employees.department_id = departments.department_id`

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 10

In [ ]:
# Answer:
run_sql("""
SELECT e.first_name, e.last_name, e.job_title, d.department_name
FROM employees e
JOIN departments d ON e.department_id = d.department_id
""")

# Expected: 15 rows with employee names and their department names

---
## Problem 11: SUM of Total Salary
**Question:** What is the total salary expense for the Engineering department (department_id = 1)?

ðŸ’¡ **Hint:** Use `SUM(salary)` with `WHERE`

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 11

In [ ]:
# Answer:
run_sql("""
SELECT SUM(salary) as total_engineering_salary
FROM employees
WHERE department_id = 1
""")

# Expected: $423,000 (75000 + 85000 + 95000 + 110000 + 58000)

---
## Problem 12: MIN and MAX Salary
**Question:** What is the minimum and maximum salary in the company?

ðŸ’¡ **Hint:** Use `MIN(salary)` and `MAX(salary)`

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 12

In [ ]:
# Answer:
run_sql("""
SELECT MIN(salary) as min_salary, MAX(salary) as max_salary
FROM employees
""")

# Expected: Min: $52,000 (Jennifer), Max: $110,000 (Robert)

---
## Problem 13: BETWEEN - Salary Range
**Question:** Find employees with salary between $60,000 and $80,000.

ðŸ’¡ **Hint:** Use `WHERE salary BETWEEN 60000 AND 80000`

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 13

In [ ]:
# Answer:
run_sql("""
SELECT * FROM employees
WHERE salary BETWEEN 60000 AND 80000
""")

# Expected: 7 rows (John, Mike, Lisa, James, Anna, Michael, Ashley, Chris)

---
## Problem 14: LIKE - Pattern Matching
**Question:** Find all employees whose job_title contains 'Manager'.

ðŸ’¡ **Hint:** Use `LIKE '%Manager%'`

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 14

In [ ]:
# Answer:
run_sql("""
SELECT * FROM employees
WHERE job_title LIKE '%Manager%'
""")

# Expected: 4 rows (Lisa - Marketing Manager, Robert - Engineering Manager, Jessica - HR Manager, Chris - Sales Manager)

---
## Problem 15: Multiple JOINs - Employee Project Details
**Question:** Show employee names, project names, and their roles on each project.

ðŸ’¡ **Hint:** Join `employees`, `employee_projects`, and `projects` tables

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 15

In [ ]:
# Answer:
run_sql("""
SELECT e.first_name, e.last_name, p.project_name, ep.role, ep.hours_worked
FROM employees e
JOIN employee_projects ep ON e.employee_id = ep.employee_id
JOIN projects p ON ep.project_id = p.project_id
ORDER BY p.project_name, e.last_name
""")

# Expected: 15 rows showing who works on which project with their role

---
## Problem 16: HAVING - Filter Groups
**Question:** Find departments that have more than 2 employees.

ðŸ’¡ **Hint:** Use `GROUP BY` with `HAVING COUNT(*) > 2`

In [ ]:
# âœï¸ Write your answer here:
run_sql("""

""")

### âœ… Answer 16

In [ ]:
# Answer:
run_sql("""
SELECT department_id, COUNT(*) as employee_count
FROM employees
GROUP BY department_id
HAVING COUNT(*) > 2
""")

# Expected: Department 1 (5 employees), Department 2 (3 employees), Department 5 (3 employees)

---
# ðŸŽ‰ Congratulations!

You've completed the Employee SQL tutorial! Here's what you learned:

| Command | What it does |
|---------|-------------|
| `SELECT` | Choose columns |
| `FROM` | Choose table |
| `WHERE` | Filter rows |
| `ORDER BY` | Sort results |
| `LIMIT` | Limit number of rows |
| `COUNT` | Count rows |
| `SUM` | Add up values |
| `AVG` | Calculate average |
| `MIN/MAX` | Find minimum/maximum |
| `GROUP BY` | Group results |
| `HAVING` | Filter groups |
| `JOIN` | Combine tables |
| `BETWEEN` | Range filter |
| `LIKE` | Pattern matching |

---

In [ ]:
# Close the database connection when done
conn.close()
print("ðŸ‘‹ Database connection closed!")